reviews/2013/2013-06-02-weekly-review.md
---
title: Weekly review: Week ending June 03, 2013 
tags: weekly
---
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Accomplished  this week</a></li>
<li><a href="#sec-2">Plans for next week</a></li>
<li><a href="#sec-3">Time review</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Accomplished  this week</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>BIZ
<ul class="org-ul">
<li>Earn 
<ul class="org-ul">
<li>android dev
</li>
</ul>
</li>
<li>Build
<ul class="org-ul">
<li>a crt project but not shipped
</li>
</ul>
</li>
<li>Connect
</li>
</ul>
</li>
<li>Relationships
<ul class="org-ul">
<li></li>
</ul>
</li>
<li>Life
<ul class="org-ul">
<li>walking with family
</li>
</ul>
</li>
<li>Learn
<ul class="org-ul">
<li>clojure and haskell documentation
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Plans for next week</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>BIZ
<ul class="org-ul">
<li>talk with guorong about next project
</li>
<li>register some ads for website
</li>
<li>open a taobao account
</li>
</ul>
</li>
<li>Life
<ul class="org-ul">
<li>sport 3 
</li>
</ul>
</li>
<li>Learn
<ul class="org-ul">
<li>finish the haskell book
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Time review</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>BIZ 11.5 hours on CRT project
</li>
<li>Learn  16.5 hours 
</li>
<li>Sleep 105.5 hours(15.1 hours per day) too much!
</li>
<li>iEmacs website 13 hours 
</li>
</ul>

<p>
too much time spent on sleep and someting useless.
</p>
</div>
</div>
